
import random
def givc():
    x=random.randint(1,39)
    if x == 1:
        x='— Почему в Африке так много болезней? — Потому что лекарства нужно запивать водой.'
    if x == 2:
        x='Моя жена — патологоанатом. Каждый раз, когда меня кто-то бесит, кидает или подводит по работе и я нервничаю, она меня обнимает и тихо говорит:\n — Не грусти, любимый. Рано или поздно, они все умрут. Я их разделаю на части, мне за это хорошо заплатят, и я куплю нам вина с пирожными!'
    if x==3:
        x='Один парень написал пост: «Ни одна девушка не заинтересована мной». Под его постом сразу появилось сообщение от девушки: «Я заинтересована».\n Парень просмотрел ее профиль и отредактировал пост, написав: «Ни одна СИМПАТИЧНАЯ девушка не заинтересована мной».'
    if x == 4:
        x='На похоронах усопшего так хвалили, что вдова три раза подходила к гробу, чтобы посмотреть, кто там лежит.'
    if x == 5:
        x = '— Бабушка, а чего ты удалилась из «Одноклассников»? — Одноклассники кончились.'
    if x== 6:
        x='Разговор покупателя с продавцом магазина: — Мне, пожалуйста, самый большой черный пакет. — Один? — Один.\n Лопату, пожалуйста, самые длинные стяжки и известь. — Вы что труп прятать собираетесь? — Два пакета…'
    if x==7:
        x='Разговор в самолете: — Я боюсь прыгать — вдруг парашют не раскроется? — Еще никто никогда не жаловался, что у него не раскрылся парашют.'
    if x==8:
        x='Не понимаю: почему, когда похищают людей в фильмах, заклеивают им рот скотчем?\nЭто банально. Засовывайте лампочки, так надежнее и веселее.'
    if x==9:
        x='Если шаурму завернуть не в лаваш, а в подорожник, кошка оживёт и убежит.'
    if x==10:
        x='"Молодой человек, а эта шаурма, до того, как стать шаурмой, она гавкала или мяукала?" "Она задавала тупые вопросы!"'
    if x==11:
        x='— Доктор, как вы думаете, что будет после смерти?\n— Мы перестелим вашу койку и положим нового пациента.'
    if x==12:
        x='Я копал яму в саду, как вдруг откопал целый сундук с золотом.\n Я уже было побежал домой, чтобы рассказать жене о ценной находке. Потом вспомнил, зачем я вообще копал яму.'
    if x==13:
        x='— Убийца был воспитанным человеком.— Почему вы так решили?\n— Все удары ножом нанесены справа, а вилкой - слева.'
    if x==14:
        x='— Дедушка, а куда ты гонишь 200 км/ч?\n— К бабушке, внучек.\n— Дедушка, она же умерла …'
    if x==15:
        x='Шутки про утопленников обычно несмешные, потому что лежат на поверхности.'
    if x==16:
        x='— Мы его теряем! Сестра, быстро, де... дефе... дерб... дерф... дефербля... дефре... деберля... дляфебриля...\n Время смерти 18:06.'
    if x==17:
        x='Если бы моя бабушка знала, сколько денег я сэкономил на её похоронах, то она бы перевернулась в канаве.'
    if x==18:
        x='Из-за сильного ветра в зоопарке дети целый день думали, что аист жив.'
    if x==19:
        x='Дедушка Мороз, в прошлом году, загадывая желание «найти мужика», я не имела в виду труп мужчины в парке, во время утренней пробежки.'
    if x==20:
        x='— Где скачать руководство по расчленению трупов?\n— Тебе заняться что ли нечем?\n— Как раз-таки есть, но надо найти руководство.'
    if x==21:
        x='Чтобы не перепутать, бабушка назвала одного новорожденного котенка Барсик, а второго утопила.'
    if x==22:
        x='Один человек сильно привязался к люстре и умер.'
    if x==23:
        x='— Мне хочется всех убить!— Сходи к психологу...\n— Психологов я уже убивал, не помогает.'
    if x==24:
        x='Программист умирает в 45 лет и попадает в рай. Он спрашивает у бога, почему же он умер так рано?\n— Сын мой, если учитывать сколько отработанных часов ты указывал в своих отчетах, ты прожил 82 года!'
    if x==25:
        x='Самая большая ложь в моей жизни - это фраза математички в школе:\n «У тебя не будет всегда с собой калькулятора в кармане».'
    if x==26:
        x='— Подскажите, как действуют таблетки для посудомойки? Выпила уже три, мыть посуду все равно не хочется.'
    if x==27:
        x='Ничтo тaк нe дeмoрaлизуeт прoтивникa, кaк шoтлaндскиe пaрaшютисты.'
    if x==28:
        x='Гороскоп на сегодня.\nСтрельцы: у вас могут быть проблемы с Овнами.\nОвны: Стрельцы считают, что вы пидор.'
    if x==29:
        x='— Как вас зовут?\n— Михаил, без «Ф».\n— Но в имени Михаил нет буквы «Ф».\n— Верно, я так и сказал.'
    if x==30:
        x='он год принцессе строил глазки\nпод арфу песни напевал\nа ей хотелось чтоб как в сказке\nи бал, и бал, и бал, и бал'
    if x==31:
        x='В суде рассматривают дело о разводе пары: 101-летнего мужчины и 98-летней женщины.\n— Вы прожили вместе 80 лет! Почему же вы разводитесь? - спрашивает судья.\n— Понимаете, ваша честь, - отвечает жена, \n- Мы давно решили развестись, но не хотели расстраивать детей. Поэтому решили подождать, пока они умрут.'
    if x==32:
        x='— Доктор, меня волнует моя высокая температура.\n— Да не волнуйтесь вы, завтра она станет комнатной!'
    if x==33:
        x='— Доктор, а что-нибудь хорошее скажете?\n— Конечно, скажу: для охотников за органами Вы уже не представляете интереса.'
    if x==34:
        x='Однажды злая колдунья предсказала королю, что его дочь уколет палец отравленным веретеном и умрёт.\nИ тогда король, чтобы спасти свою дочь, приказал отрубить ей пальцы...'
    if x==35:
        x='— Алло, полиция? Я застукала мужа с любовницей...\n— Ну, а нам-то чего звоните?\n— Так ведь насмерть застукала!'
    if x==36:
        x='- Ноги твоей больше тут не будет! - кричал хирург перед ампутацией.'
    if x==37:
        x='Ольга, хоть и промахнулась в тире, но и взять мишку ей уже никто не помешал…'
    if x==38:
        x='Cегодня днём пришла смс: "Я живу в доме напротив, давай познакомимся".\n Я ответила, что живу напротив морга и меня пугают такие знакомства.'
    if x==39:
        x='Маленький мальчик на крыше сидел,\n Солнечный луч ему голову грел,\n Рухнула крыша,хрустнули кости,\n Нет не поедем мы к мальчику в гости!'
    return x
